namespace ConventionWizardForUnity.Enum
{
    ///==========================================================================================================================
    ///
    ///  Resource Update State
    ///  ------------------------------------------------------------------------------------------------------------------------
    ///  <summary>
    ///  Convention Wizard에서 사용하고자하는 리소스의 업데이트 상황
    ///  </summary>
    ///
    ///==========================================================================================================================
    public enum RESOURCE_UPDATE_STATE
    {
        UNKOWN = -1,                    // 아직 알지못함
        UPDATE_REQUIRED = 0,            // 업데이트 필요함
        LATEST = 1                      // 업데이트 필요 없음
    }
}